[
    "Alexander the Great, king of Macedon, created a vast empire, undefeated in battle, and left a lasting cultural legacy influencing the Hellenistic period and beyond.",
    "Alexander the Great was born in Pella, Macedon, to Philip II and Olympias. Legends of divine parentage and early accomplishments foreshadowed his future greatness.",
    "At 13, Alexander was tutored by Aristotle, learning philosophy, medicine, and arts alongside future generals. His education influenced his leadership and passion for Homeric epics.",
    "At 16, Alexander became regent, quelling revolts and leading successful military campaigns. He played a key role in the decisive Battle of Chaeronea, securing Macedonian dominance in Greece.",
    "Philip's marriage to Cleopatra Eurydice jeopardized Alexander's position as heir, leading to tensions. Alexander briefly fled Macedon but returned after mediation, though tensions persisted with Philip.",
    "Philip II was assassinated at his daughter's wedding in 336 BC. Alexander, then 20, was immediately proclaimed king by the nobles and army.",
    "Upon becoming king, Alexander eliminated rivals and quickly quelled revolts in Thessaly and Greece. He secured leadership of the Amphictyonic League and was appointed commander for the Persian campaign.",
    "In 335 BC, Alexander quelled northern revolts by defeating Thracians, Triballi, Getae, and Illyrian chieftains, securing his northern borders before advancing to Asia.",
    "Alexander swiftly quelled the Theban rebellion, destroying the city and redistributing its land. This forced Athens to submit, leading to temporary peace in Greece before Alexander's Asian campaign.",
    "After Philip's death, Alexander continued his father's campaign, crossing into Asia in 334 BC. He won at Granicus, seized Sardis, and conducted sieges in Miletus and Halicarnassus, showcasing his military and strategic prowess.",
    "In 333 BC, Alexander defeated Darius at Issus, capturing his family and treasure. He then seized Syria and the Levant coast. In 332 BC, he conquered Tyre after a prolonged siege.",
    "Alexander besieged Gaza before moving into Egypt, where he was crowned pharaoh at Memphis and consulted the oracle at Siwa Oasis. He founded Alexandria, which later became a key city under the Ptolemaic Dynasty.",
    "After leaving Egypt in 331 BC, Alexander defeated Darius III at the Battle of Gaugamela, leading to Darius’s flight and Alexander’s capture of Babylon. He assured Babylonians that he would respect their homes, according to astronomical diaries.",
    "Alexander captured Persepolis, allowed looting, and a fire broke out, possibly started by Thaïs. He later regretted the destruction and pondered Xerxes' legacy.",
    "Alexander chased Darius into Media and Parthia. After Darius was killed by Bessus, Alexander defeated Bessus, founded new cities, and quelled revolts in Central Asia.",
    "Alexander adopted Persian customs, including proskynesis, to gain Iranian support, but faced backlash from Greeks. He executed Philotas, Parmenion, and Cleitus, and tortured Callisthenes, amid various plots against him.",
    "While Alexander campaigned in Asia, Antipater managed Greece, defeating Spartan king Agis III and maintaining peace. Alexander's demands for troops weakened Macedon, leading to its Roman subjugation later.",
    "Between 356 and 342 BC, Philip II seized gold and silver mines in Pangaeum and Thasos. Alexander introduced new coinage in Cilicia after Issus, featuring Athena, Nike, Heracles, and Zeus. His coins had both Greek and local influences but did not replace existing Persian coins.",
    "Alexander's campaign in the Indian subcontinent saw alliances with local rulers, battles against resistant tribes, and victories like the Battle of Hydaspes, expanding his empire significantly.",
    "Alexander's army mutinied at the Hyphasis River, halting further eastward advance. He returned south, suffered a serious injury, and lost many men crossing the Gedrosian Desert.",
    "Upon returning to Persia, Alexander executed corrupt satraps, faced a mutiny over Persian customs, and held a mass marriage. He mourned Hephaestion's death but died soon after.",
    "Alexander's death on 10 or 11 June 323 BC remains debated. Theories include poisoning, natural causes like typhoid fever, or other illnesses. The poison theory faces skepticism due to the illness duration.",
    "Alexander's body was initially buried in Memphis and later Alexandria, with his sarcophagus eventually replaced. The fate of his tomb remains unclear, though various emperors visited it.",
    "Alexander's sudden death led to confusion over his heir. Rival generals and satraps fought for power, resulting in a 40-year struggle and eventual division into three kingdoms.",
    "Alexander's \"last plans\" outlined grand military and cultural projects. However, successors deemed them impractical, and some scholars suspect they were later exaggerations or fabrications.",
    "Alexander earned the title \"the Great\" through superior tactics, adapting his strategies to diverse opponents, using terrain effectively, and never losing a battle despite often being outnumbered.",
    "Alexander's appearance is debated, with conflicting sources and artistic depictions. Lysippos's sculptures are considered the most accurate, while other descriptions vary.",
    "Alexander, influenced by his ambitious parents, had a volatile but intelligent nature. His sense of destiny, combined with megalomania and pragmatism, shaped his rule and legacy.",
    "Alexander married Roxana for love and Stateira and Parysatis for political gain. He had two sons, was deeply affected by Hephaestion's death, and faced health issues.",
    "Alexander's sexuality is debated; ancient sources hint at relationships with boys and Hephaestion. He fathered a child late in life and used his harem sparingly.",
    "empty",
    "Alexander’s conquests linked East and West, spreading Greek culture, founding lasting cities, and enhancing trade. His campaigns broadened Greek perspectives beyond the Mediterranean.",
    "Alexander’s empire, the largest of its time, left a legacy of Macedonian and Greek influence. His power vacuum led to the rise of India’s Maurya Empire.",
    "Alexander founded numerous cities, including Alexandria in Egypt. Initially defensive, these cities later thrived with Greek and local populations, becoming significant Mediterranean centers.",
    "Alexander funded several temples, including one to Athena in Priene and potentially another in Girsu, Iraq. These structures reflect his dedication to deities and his legacy.",
    "Hellenization spread Greek culture and language across Alexander's empire, influencing cities, dialects, and art. The Koine Greek became a major lingua franca, shaping later cultures.",
    "Hellenization deeply influenced South Asia, blending Greek and Buddhist cultures, art, and ideas. Greco-Buddhist art, syncretism, and trade with Greece significantly impacted Indian civilization.",
    "Alexander was admired by Romans, who emulated him and used his image as a model for greatness or cautionary tale. His influence shaped later Roman and Byzantine culture.",
    "Alexander's original letters have not survived; only a few official copies and historical quotes exist. Some letters in Romance tradition may be fictional.",
    "Legends about Alexander, some encouraged by him, include exaggerated tales. The Alexander Romance, falsely attributed to Callisthenes, contains many dubious stories and was widely translated.",
    "Alexander the Great's legacy spans cultures and eras, depicted as a hero in Greek folklore, Persian literature, Islamic texts, and modern media, including novels and films.",
    "Accounts of Alexander the Great by contemporaries are lost, but later works by Diodorus, Curtius Rufus, Arrian, Plutarch, and Justin provide key historical insights, with Arrian deemed most reliable."
]